#Область ПрограммныйИнтерфейс

// Добавляет в переданную форму поле "Контактное лицо" после поля "Договор".
//
// Параметры:
//   Форма - Форма - целевая форма для добавления поля.
//
Процедура ДобавитьКонтактноеЛицоКДоговору(Форма) Экспорт
	
	ПолеДоговора = НайтиПолеДоговора(Форма);
	
	Если ПолеДоговора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоордСледующего = НайтиСледующий(ПолеДоговора);
	
	НовЭлемент = Форма.Элементы.Вставить("КЛ_КонтактноеЛицо", Тип("ПолеФормы"),
		КоордСледующего.Родитель, КоордСледующего.Следующий);		
	
	НовЭлемент.ПутьКДанным = "Объект.КЛ_КонтактноеЛицо";
	НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры

// Добавляет в форму реквизит КонтатныеЛица типа ДинамическийСписок для отображения
// списка связанных с контрагентом контактных лиц.  
//
// Параметры:
//   Форма - Форма - целевая форма для добавления поля.
//
Процедура ДобавитьСпискокКонтактныхЛиц(Форма) Экспорт
	
	РеквизитКЛ = Новый РеквизитФормы("КонтактныеЛица", Новый ОписаниеТипов("ДинамическийСписок")); 
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(РеквизитКЛ);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Форма.КонтактныеЛица.ОсновнаяТаблица = "Справочник.КЛ_КонтактныеЛица";
	Форма.КонтактныеЛица.ПроизвольныйЗапрос = Истина;
	Форма.КонтактныеЛица.ТекстЗапроса = "
		|ВЫБРАТЬ
		|	СправочникКЛ_КонтактныеЛица.Ссылка КАК Ссылка,
		|	СправочникКЛ_КонтактныеЛица.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникКЛ_КонтактныеЛица.Владелец КАК Владелец,
		|	СправочникКЛ_КонтактныеЛица.Наименование КАК Наименование,
		|	СправочникКЛ_КонтактныеЛица.Телефон КАК Телефон,
		|	СправочникКЛ_КонтактныеЛица.Должность КАК Должность,
		|	СправочникКЛ_КонтактныеЛица.ОснованиеДействия КАК ОснованиеДействия,
		|	СправочникКЛ_КонтактныеЛица.Заметка КАК Заметка,
		|	СправочникКЛ_КонтактныеЛица.Предопределенный КАК Предопределенный,
		|	СправочникКЛ_КонтактныеЛица.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.КЛ_КонтактныеЛица КАК СправочникКЛ_КонтактныеЛица
		|ГДЕ
		|	СправочникКЛ_КонтактныеЛица.Владелец = &Владелец
		|	И СправочникКЛ_КонтактныеЛица.ПометкаУдаления = ЛОЖЬ";   	 
	
КонецПроцедуры

// Добавляет в форму группу, содержащую поле ввода, и комманду для работы со скидкой в документе.
// Объект данных формы должен иметь числовой реквизит "КЛ_СогласованнаяСкидка".
// Для обработки событий элементов добавляемой группы форма должна содержать методы:
//  "Подключаемый_ПриИзмененииСкидки" - действие при изменении значения в поле ввода  
//  "Подключаемый_ПересчетСоСкидкой" - обработчик выполнения команды "Пересчет"
//
// Параметры:
//  Форма - Форма - целевая форма для добавления элементов
//  РодительскаяГруппа - ГруппаФормы - родительская группа для добавляемых элементов
//
Процедура ДобавитьЭлементыУстановкиСкидки(Форма, РодительскаяГруппа) Экспорт
	
	ГруппаСкидка = Форма.Элементы.Добавить("КЛ_ГруппаСкидка", Тип("ГруппаФормы"), РодительскаяГруппа);
	ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;  
	ГруппаСкидка.ОтображатьЗаголовок = Ложь;	    
	ГруппаСкидка.СквозноеВыравнивание = СквозноеВыравнивание.Использовать; 
	
	ЭлементСкидка = Форма.Элементы.Добавить("КЛ_Скидка", Тип("ПолеФормы"), ГруппаСкидка);  
	ЭлементСкидка.Заголовок = "Скидка";
	ЭлементСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСкидка.ПутьКДанным = "Объект.КЛ_СогласованнаяСкидка";  
	ЭлементСкидка.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииСкидки");
	
	КомандаРасчет = Форма.Команды.Добавить("КЛ_ПересчетСоСкидкой");
	КомандаРасчет.Заголовок = "Пересчет";
	КомандаРасчет.Картинка = БиблиотекаКартинок.Обновить;
	КомандаРасчет.Отображение = ОтображениеКнопки.КартинкаИТекст;  
	КомандаРасчет.Действие = "Подключаемый_ПересчетСоСкидкой";
	
	КнопкаРасчет = Форма.Элементы.Добавить("КЛ_ПересчетСоСкидкой", Тип("КнопкаФормы"), ГруппаСкидка);
	КнопкаРасчет.ИмяКоманды = "КЛ_ПересчетСоСкидкой";   
		
КонецПроцедуры      

// Скрывает стандартное содержание группы КонтаткнаяИнформация и добавляет в группу
// таблицу формы для вывода списка контактных лиц из справочника КонтакныеЛица
// Форма должна иметь реквизт "КонтактныеЛица" типа ДинамическийСписок  
// Для обработки событий добавляемых элементов форма должна содержать методы:
//  "Подключаемый_ПередНачаломДобавленияКЛ" - перед начало добавления в таблицу
//  "Подключаемый_ВыборКЛ" - при выборе в таблице
//	"Подключаемый_ЗаписьИзКонтакныхЛиц" - при нажатии на ссылку "записать" в строке-декорации    
//
// Параметры:
//  Форма - Форма - целевая форма для добавления элементов
// 
Процедура ДобавитьЭлементыОтображенияКонтактныхЛиц(Форма) Экспорт  
	
	// Скрываем элементы, добавленные БСП
	СтандартныеРеквизиты = Форма.Элементы.ГруппаКонтактнаяИнформация.ПодчиненныеЭлементы;
	Для Каждого СтандатрныйРеквизит Из СтандартныеРеквизиты Цикл
		СтандатрныйРеквизит.Видимость = Ложь;
	КонецЦикла;
	
	// Создаем таблицу формы
	ТаблицаФормыКЛ = Форма.Элементы.Добавить("КонтактныеЛица", Тип("ТаблицаФормы"), Форма.Элементы.ГруппаКонтактнаяИнформация);
	ТаблицаФормыКЛ.ПутьКДанным = "КонтактныеЛица";  
	ТаблицаФормыКЛ.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы;
	ТаблицаФормыКЛ.ВысотаВСтрокахТаблицы = 5;
	
	КолонкиСтрока = "Ссылка,Наименование,Телефон,Должность,ОснованиеДействия,Заметка";
	КолонкиМассив = СтрРазделить(КолонкиСтрока, ",");
	
	Для Каждого Колонка Из КолонкиМассив Цикл  
		ИмяПоля = СтрШаблон("КонтактныеЛица%1", Колонка);
		ПутьКДанным = СтрШаблон("КонтактныеЛица.%1", Колонка);
		НовоеПоле = Форма.Элементы.Добавить(ИмяПоля, Тип("ПолеФормы"), ТаблицаФормыКЛ);  
		НовоеПоле.ПутьКДанным = ПутьКДанным;	
		
		Если Колонка = "Ссылка" Тогда 
			НовоеПоле.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;         
	
	ТаблицаФормыКЛ.УстановитьДействие("ПередНачаломДобавления", "Подключаемый_ПередНачаломДобавленияКЛ");
	ТаблицаФормыКЛ.УстановитьДействие("Выбор", "Подключаемый_ВыборКЛ");
	
	// Создаем декорацию, заменяющую таблицу формы для нового не записанного объекта
	ЗаголовокДекорации = Новый ФорматированнаяСтрока(
		"Прежде чем добавлять контантакные лица необходимо ",
		Новый ФорматированнаяСтрока("записать", , , ,"ЗаписатьИзКонтактныхЛиц"),
		" изменения"
	);
	
	ДекорацияКЛ = Форма.Элементы.Добавить("ЗаписатьИзКонтактныхЛиц", Тип("ДекорацияФормы"), Форма.Элементы.ГруппаКонтактнаяИнформация);
	ДекорацияКЛ.Заголовок = ЗаголовокДекорации;
	ДекорацияКЛ.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_ЗаписьИзКонтакныхЛиц");
	ДекорацияКЛ.АвтоМаксимальнаяШирина = Ложь;
	
КонецПроцедуры

// Добавляет в форму группу, содержащую поле СтатусЗаказа
//
// Параметры:
//  Форма - Форма - целевая форма для добавления элементов
//  РодительскаяГруппа - ГруппаФормы - родительская группа для добавляемых элементов
//
Процедура ДобавитьЭлементыСтатусЗаказа(Форма, РодительскаяГруппа) Экспорт
	
	ГруппаСтатус = Форма.Элементы.Добавить("КЛ_ГруппаСтатусЗаказа", Тип("ГруппаФормы"), РодительскаяГруппа);
	ГруппаСтатус.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтатус.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;  
	ГруппаСтатус.ОтображатьЗаголовок = Ложь;	    
	ГруппаСтатус.СквозноеВыравнивание = СквозноеВыравнивание.Использовать; 
	
	ЭлементСтатус = Форма.Элементы.Добавить("КЛ_СтатусЗаказа", Тип("ПолеФормы"), ГруппаСтатус);  
	ЭлементСтатус.Заголовок = "Статус заказа";
	ЭлементСтатус.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСтатус.ПутьКДанным = "Объект.КЛ_СтатусЗаказа";
	
			
КонецПроцедуры      

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция НайтиПолеДоговора(Форма)
	
	Для Каждого Элемент Из Форма.Элементы Цикл 
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") И Элемент.ПутьКДанным = "Объект.Договор" Тогда
			Возврат Элемент;
		КонецЕсли;		
	КонецЦикла;   
	
	Возврат Неопределено;

КонецФункции   

Функция НайтиСледующий(ПолеДоговора)
	
	Родитель = ПолеДоговора.Родитель;
	
	Инд = Родитель.ПодчиненныеЭлементы.Индекс(ПолеДоговора);
	
	СледИнд = Инд + 1;
	
	Результат = Новый Структура;
	Результат.Вставить("Родитель", Родитель);
	
	Если СледИнд < Родитель.ПодчиненныеЭлементы.Количество() Тогда   
		Результат.Вставить("Следующий", Родитель.ПодчиненныеЭлементы[СледИнд]);
	Иначе
		Результат.Вставить("Следующий", Неопределено);
	КонецЕсли;		
	
	Возврат Результат;  	
КонецФункции

#КонецОбласти