
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды    
	
	// Отображение Контактных лиц в форме. Шагинян С.В. 06.09.2026
	КЛ_УправлениеДинамическимиПолями.ДобавитьКонтактноеЛицоКДоговору(ЭтаФорма);  
    // Конец Отображение Контактных лиц в форме  
	
	// Учет скдики при расчете цен. Шагинян С.В. 06.09.2026  
	КЛ_УправлениеДинамическимиПолями.ДобавитьЭлементыУстановкиСкидки(ЭтаФорма, Элементы.ГруппаШапкаЛево);
    // Конец Учет скдики при расчете цен
	
	// Статусы заказа. Шагинян С.В. 27.09.2026  
	КЛ_УправлениеДинамическимиПолями.ДобавитьЭлементыСтатусЗаказа(ЭтаФорма, Элементы.ГруппаШапкаПраво);
    // Статусы заказа 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	// Учет скдики при расчете цен. Шагинян С.В. 06.09.2026
	
	ТекущиеДанные.Сумма = РассчитатьСуммуСтрокиСУчетомСкидки(ТекущиеДанные);

	// Конец Учет скдики при расчете цен  
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти


// Учет скдики при расчете цен. Шагинян С.В. 06.09.2026  
#Область ПроцедурыИФункцииРаботыСоСкидкой

&НаКлиенте
Процедура Подключаемый_ПересчетСоСкидкой(Команда) 

	ПересчитатьТаблицу();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииСкидки(Элемент)
	
	ТребуетсяПересчет = (Объект.Товары.Количество() > 0 ИЛИ Объект.Услуги.Количество() > 0);
	Если ТребуетсяПересчет Тогда
		ПересчитатьСПодтверждением();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТаблицу()
	
	Для Каждого Товар Из Объект.Товары Цикл 
		Товар.Сумма = РассчитатьСуммуСтрокиСУчетомСкидки(Товар);
	КонецЦикла;     
	
	Для Каждого Услуга Из Объект.Услуги Цикл
		Услуга.Сумма = РассчитатьСуммуСтрокиСУчетомСкидки(Услуга);
	КонецЦикла;   
	
	РассчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Асинх Процедура ПересчитатьСПодтверждением()
	
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Пересчитать таблицу?'"), РежимДиалогаВопрос.ДаНет, ,
		КодВозвратаДиалога.Да, НСтр("ru = 'Скидка изменена'"));  
		
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПересчитатьТаблицу();
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Функция РассчитатьСуммуСтрокиСУчетомСкидки(ТекущиеДанные)
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("Количество", ТекущиеДанные.Количество);
	ДанныеСтроки.Вставить("Цена", ТекущиеДанные.Цена);
	ДанныеСтроки.Вставить("Скидка", ТекущиеДанные.Скидка);
	ДанныеСтроки.Вставить("СогласованнаяСкидка", Объект.КЛ_СогласованнаяСкидка);
	
	Возврат РассчитатьСуммуСтрокиНаСервере(ДанныеСтроки);
	
КонецФункции  

&НаСервереБезКонтекста
Функция РассчитатьСуммуСтрокиНаСервере(ДанныеСтроки) 
	
	Возврат Документы.ЗаказПокупателя.РассчитатьСуммуСтрокиСУчетомСкидки(ДанныеСтроки);
	
КонецФункции  

#КонецОбласти  

#КонецОбласти
