#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");	
	Поля.Добавить("ОснованиеДействия");	
		
КонецПроцедуры    

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
		
	ОснованиеДействия = Данные.ОснованиеДействия;
	
	Если ЗначениеЗаполнено(ОснованиеДействия) Тогда
		СтандартнаяОбработка = Ложь;   
		Шаблон = "%1 (%2)";
		Представление = СтрШаблон(Шаблон, Данные.Наименование, ОснованиеДействия);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
