
#Область ОбработчикиСобытийФормы

// Параметры:
//  Отказ - Булево - Флаг отказа от создания формы.
//  СтандартнаяОбработка - Булево - Флаг стандартной обработки платформы.
//  Параметры - Структура:
//   * БлокироватьВладельца - Булево - Описание вашего кастомного свойства.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("БлокироватьВладельца") Тогда
		Элементы.Владелец.ТолькоПросмотр = Параметры.БлокироватьВладельца; // @Булево
	КонецЕсли;
	
	ЗначенияЗаполнения = Параметры.ЗначенияЗаполнения;  
	Если ЗначенияЗаполнения.Свойство("Владелец") Тогда    
		Элементы.Владелец.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры    

#КонецОбласти
